Revit 2027 API
IExtension.SymbolicExtended Property
Retrieves or set the symbolic extension status at the end
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool this[
	int index
] { get; set; }
Property SymbolicExtended (
	index As Integer
) As Boolean
	Get
	Set
property bool SymbolicExtended[int index] {
	bool get (int index);
	void set (int index, bool value);
}
abstract SymbolicExtended : bool with get, set
Parameters
index Int32
Property Value
Boolean
Remarks
Property index must be 0 or 1 to indicate two ends, otherwise exceptions will be thrown. For beams, symbolic extension setting only works when the beam is extended, mitered, and miter locked at the end. Otherwise the setting is invalid
See Also
Reference
IExtension Interface
Autodesk.Revit.DB Namespace